print ("🫧 🪻 ♡︎ ~。.:* 🫧 ~ ♡︎ 🪻。.:* 🫧 ~ ♡︎ ~ 。.: 🪻 *🫧° ~ ⟡ ♡︎ ~  。 🪻 .:*🫧♡︎ ♡︎ 🫧 。.:* ~ ♡︎  ~     🪻     ♡︎ ~  🫧 ♡︎~ 。.:* 🪻 ~° ~ ♡︎ ⟡。.:* 🫧 🪻。.: 🫧 *~° ⟡ ♡︎ ~ 。 🪻 .:*🫧° ⟡ ♡︎ ♡︎ 🪻    🫧   ·  🪻 ♡︎~ 。.:* 🫧 ~° ⟡ ♡︎~ 🪻🫧 🪻 ♡︎ ~。.:* 🫧 ~ ♡︎ 🪻。.:* 🫧 ~ ♡︎ ~ 。.: 🪻 *🫧° ~ ⟡ ♡︎ ~  。 🪻 .:*🫧♡︎ ♡︎ 🫧 。.:* ~ ♡︎  ~     🪻     ♡︎ ~  🫧 ♡︎~ 。.:* 🪻 ~° ~ ♡︎ ⟡。.:* 🫧 🪻。.: 🫧 *~° ⟡ ♡︎ ~ 。 🪻 .:*🫧° ⟡ ♡︎ ♡︎ 🪻    🫧   ·  🪻 ♡︎~ 。.:* 🫧 ~° ⟡ ♡︎~ 🪻🫧 🪻 ♡︎ ~。.:* 🫧 ~ ♡︎ 🪻。.:* 🫧 ~ ♡︎ ~ 。.: 🪻 *🫧° ~ ⟡ ♡︎ ~  。 🪻 .:*🫧♡︎ ♡︎ 🫧 。.:* ~ ♡︎  ~     🪻     ♡︎ ~  🫧 ♡︎~ 。.:* 🪻 ~° ~ ♡︎ ⟡。.:* 🫧 🪻。.:H E L L O ! 🫧 *~° ⟡ ♡︎ ~ 。 🪻 .:*🫧° ⟡ ♡︎ ♡︎ 🪻    🫧   ·  🪻 ♡︎~ 。.:* 🫧 ~° ⟡ ♡︎~ 🪻🫧 🪻 ♡︎ ~。.:* 🫧 ~ ♡︎ 🪻。.:* 🫧 ~ ♡︎ ~ 。.: 🪻 *🫧° ~ ⟡  W E L C O M E ♡︎ ~  。 🪻 .:*🫧♡︎ ♡︎ 🫧 。.:* ~ ♡︎  ~     🪻     ♡︎ ~  🫧 ♡︎~ 。.:* 🪻 ~° ~ ♡︎ ⟡。.:* 🫧 🪻。.: 🫧 *~°⟡ ♡︎ ~ 。 🪻 .:*🫧° ⟡ ♡︎ ♡︎ 🪻    🫧   ·  🪻 ♡︎~ 。.:* 🫧 ~° ⟡ ♡︎~ 🪻🫧 🪻 ♡︎ ~。.:* 🫧 ~ ♡︎ 🪻。.:* 🫧 ~ ♡︎ ~ 。.: 🪻 *🫧° ~ ⟡ ♡︎ ~  。 🪻 .:*🫧♡︎ ♡︎ 🫧 。.:* ~ ♡︎  ~     🪻     ♡︎ ~  🫧 ♡︎~ 。.:* 🪻 ~° ~ ♡︎ ⟡。.:* 🫧 🪻。.: 🫧 *~° ⟡ ♡︎ ~ 。 🪻 .:*🫧° ⟡ ♡︎ ♡︎ 🪻    🫧   ·  🪻 ♡︎~ 。.:* 🫧 ~° ⟡ ♡︎~ 🪻"
)
       
print("\nFibonacci Sequence\n")

#fuction fibo

def recur_fibo(n):
   if n <= 1:
       return n
   else:
       return(recur_fibo(n-1) + recur_fibo(n-2))

nterms = int(input("Enter a number: "))

#check if it is a positive number

if nterms <= 0:
   print("Plese enter a positive integer")
else:
   print("Fibonacci sequence:")
   for terms in range(nterms):
       print(recur_fibo(terms))